---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SystemNavigatorFailures
source: html/cad59467-5652-cc4c-4f2b-bf8645ab04eb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemNavigatorFailures

Failures related with the system browser.

## Syntax (C#)
```csharp
public static class SystemNavigatorFailures
```